[
  {
    "id": "go-raw-packet-scanner",
    "title": "'What I Learned Building a Go-Powered Raw Packet Scanner (Part 1)'",
    "date": "'2026-01-02'",
    "tags": [
      "GO",
      "NETWORKING",
      "SECURITY",
      "ENGINEERING"
    ],
    "excerpt": "'Part 1 of the Revealr series. Raw packet crafting in Go is messy and unforgiving. Learn how to bypass net.Dial, handle OS interference, and build a SYN scanner from scratch.'",
    "author": "'ROUNAK'",
    "content": "*This is Part 1 of a blog series where I write about the mistakes, crashes, and lessons I learned while building **Revealr**, my own network scanner.*\n\n---\n\nWe all know `nmap`. You run `nmap -sS target`, and within seconds, it calmly tells you exactly which ports are open.\n\nFor a long time, I had a simple explanation in my head for why it was so fast:\n*\"These tools are fast because they are written in C by geniuses from 30 years ago who understood things I never will.\"*\n\nBut recently, I started writing more Go. And naturally, this thought came up:\n*Go is fast. Go has Goroutines. Why can't I just launch 10,000 goroutines and scan ports myself?*\n\nSo I tried. And that’s when I realized something important: **It’s not about the language. It’s about the technique.**\n\n## The Real Problem: Being Too \"Polite\"\n\nIf you write a normal Go scanner using the standard library function `net.Dial(\"tcp\", \"target:80\")`, you are doing things the \"official\" way. You are asking the Operating System (OS) to make a full connection.\n\nThink of it like calling a friend:\n\n1. You dial the number.\n2. They pick up.\n3. You say \"Hello.\"\n4. They say \"Hello.\"\n5. **Then** you hang up.\n\nThis is the **TCP Three-Way Handshake**.\n\nThis is safe, but it is heavy.\nIf you scan 1,000 ports this way, you are making 1,000 full phone calls. Your computer works hard to track the state of every call, the target server gets annoyed by the logs, and firewalls start blocking you.\n\n## The \"Missed Call\" Technique (SYN Scan)\n\nProfessional scanners don’t make full calls. They give a **Missed Call**.\n\n1. **Send SYN** (The Ring).\n2. **Receive SYN-ACK** (The phone was picked up).\n3. **Send RST** (Cut the call immediately).\n\nYou never say hello. You never start a conversation. You just confirm that someone picked up.\n\nThat’s what a **SYN Scan** is.\n\n* **Fast:** No waiting for handshakes.\n* **Stealthy:** Less likely to clutter application logs.\n* **Efficient:** Your OS doesn't need to allocate memory for a full socket.\n\nBut here is the catch: **You cannot do this with `net.Dial`.** The standard library forces you to be polite. To send a \"Missed Call,\" you have to craft the packets yourself—byte by byte.\n\n## The \"Oh No\" Phase: Crafting Packets by Hand\n\nAt first, I genuinely thought: *\"It’s just data bytes. How hard can it be?\"*\n\nIt turns out, very hard.\n\nWhen you use **Raw Sockets**, the OS stops helping you. You are responsible for building the Ethernet header, the IP header, and the TCP header manually.\n\n* One wrong bit? The packet is dropped.\n* No error message.\n* No warning.\n* Just silence.\n\n**The Checksum Bug That Cost Me Hours**\nI spent 6 hours one night debugging a scanner that worked perfectly on `localhost` but failed completely on my LAN. Wireshark showed packets leaving my laptop, but no replies ever came back.\n\nThe issue? **The TCP Checksum.**\n\nTCP checksums are calculated using a \"Pseudo-Header\"—a fake header that includes the Source IP and Destination IP. I had forgotten to include this step. The routers on the network looked at my packet, did the math, saw it didn't match, and silently threw my packets in the trash.\n\nHere’s what the packet construction actually looks like using the `gopacket` library. Notice the comment I added to save my future self:\n\n```go\n// Constructing the TCP Layer\ntcpLayer := &layers.TCP{\n    SrcPort: layers.TCPPort(srcPort),\n    DstPort: layers.TCPPort(dstPort),\n    Seq:     1105024978, // Random sequence number\n    SYN:     true,       // The \"Missed Call\" flag\n    Window:  14600,      // Window size\n}\n\n// CRITICAL: You must tell the TCP layer about the IP layer.\n// Without this, the checksum calculation WILL be wrong.\ntcpLayer.SetNetworkLayerForChecksum(ipLayer)\n\n// Serialize the layers into bytes\nbuf := gopacket.NewSerializeBuffer()\nopts := gopacket.SerializeOptions{\n    FixLengths:       true, \n    ComputeChecksums: true,\n}\nerr := gopacket.SerializeLayers(buf, opts, ethLayer, ipLayer, tcpLayer)\n\n```\n\n## When Your Own OS Becomes the Enemy\n\nThis was the most confusing bug I faced—and honestly, one of the most educational.\n\nI finally got the SYN packet crafting right.\n\n* Packets were going out.\n* Servers were replying with SYN-ACK.\n* Everything looked perfect in Wireshark.\n\nAnd yet… my scanner showed **nothing**. No open ports. Just silence.\n\n**What Was Actually Happening?**\nI was running the scanner on my own laptop. When a server replied with a SYN-ACK, my **Operating System kernel** saw that packet too, not just my program.\n\nThe OS Kernel thought:\n*\"Wait, I don't remember starting a TCP connection to this server. Why is it replying to me?\"*\n\nFrom the Kernel’s point of view, this looked suspicious. So it did what it is designed to do. It immediately sent a **RST (Reset)** packet back to the server.\n\nBasically, my OS was telling the server: *\"Ignore this. I didn't ask for it.\"*\n\nBy the time my scanner tried to read the response, the connection was already dead. My own system was sabotaging me—not out of malice, but out of correctness.\n\n**The Fix: The Dummy Listener**\nTo fix this, you have to convince the OS to stop panicking. There are a few ways to do this (like complex `iptables` firewall rules), but the approach I used early on was a **Dummy Listener**.\n\nThe idea is simple:\n\n1. Open a standard local socket on the *exact same source port* you are using for scanning.\n2. Don't send any data through it. Just let it sit there.\n3. Now, when the SYN-ACK comes back, the Kernel sees the open socket and thinks:\n*\"Ah, I see an owner for this port. This traffic is expected.\"*\n\nOnce the Kernel sees a listener bound to that port, it stops sending the automatic RST packets. Your raw packet code finally gets the response without interference.\n\n*(I’m intentionally not dumping the full implementation here because it involves some tricky edge cases with port reuse, and there are cleaner ways to do it depending on if you are on Linux or Windows. I will break this down properly in the next blog).*\n\n## The Correlation Problem (Matching Replies)\n\nAnother thing that confused me early on: Once you send 5,000 packets into the void, the replies come back in random order. Packets don't come back with a sticky note saying *\"Replying to scan job #42.\"*\n\nYou need a way to match the answer to the question.\n\nI used a simple **Correlation Map**. I created a unique key for every probe I sent out.\n\n```go\n// Key format: \"TargetIP:TargetPort:MyPort\"\nkey := fmt.Sprintf(\"TCP:%s:%d:%d\", srcIP, remotePort, localPort)\n\n// Store the channel so we know where to send the reply\nps.correlationMap.Store(key, responseChan)\n\n```\n\nWhen a packet arrives, I check the map. If the key exists, I pass the packet to the waiting goroutine. If not, I ignore it. It’s not fancy, but it is reliable under load.\n\n## Major Takeaways\n\nIf you are planning to try this, keep these hard-earned lessons in mind:\n\n1. **You Need Root/Admin:** You cannot send raw packets without `sudo` (Linux) or Administrator (Windows). The OS doesn't trust normal users with this power.\n2. **MAC Addresses Matter:** If you are scanning outside your local network (like on the internet), your Destination MAC is **your Gateway's MAC**, not the target server's MAC. I wasted a full day figuring this out.\n3. **Rate Limit Aggressively:** Home routers are fragile creatures. If you flood them with 10,000 packets at once, they will just crash. Use a semaphore or a token bucket to limit your speed.\n\n## Final Thoughts\n\nHigh-level networking feels clean and simple. Raw networking is not.\nIt is messy. It is unforgiving. And you are fighting two battles: one against the network, and one against your own Operating System.\n\nBut once you understand raw packets, the network stack stops feeling like magic—and starts feeling like exposed wiring. And when your code correctly identifies its first open port from a raw SYN-ACK?\n\nThat feeling stays.\n\n**Coming Next in Part 2:**\nI’ll go deeper into **UDP Scanning**—where silence means everything, and debugging feels like shouting into a dark cave and waiting for an echo. (And I'll show you the full code for managing that Dummy Listener).",
    "snippet": "*This is Part 1 of a blog series where I write about the mistakes, crashes, and lessons I learned while building **Revealr**, my own network scanner.*\n\n---\n\nWe all know `nmap`. You run `nmap -sS targe..."
  }
]